In [2]:
import pandas as pd

In [10]:
nomes_masc = pd.read_csv('dados/nomes-masculinos.csv')
nomes_masc.shape

(800, 1)

In [7]:
nomes_masc.head()

       nome
0    Miguel
1    Arthur
2      Davi
3  Bernardo
4   Gabriel

In [17]:
nomemasc = nomes_masc.drop_duplicates()

In [20]:
nomemasc.head()

       nome
0    Miguel
1    Arthur
2      Davi
3  Bernardo
4   Gabriel

In [23]:
nomemasc= nomemasc.assign(genero = 'masculino')

In [24]:
nomemasc.head()

       nome     genero
0    Miguel  masculino
1    Arthur  masculino
2      Davi  masculino
3  Bernardo  masculino
4   Gabriel  masculino

In [25]:
nomefem = pd.read_csv('dados/nomes-femininos.csv')
nomefem.head()

       nome
0    Sophia
1     Júlia
2     Laura
3  Isabella
4     Luiza

In [26]:
nomefem.shape

(800, 1)

In [27]:
nomefem = nomefem.drop_duplicates()

In [28]:
nomefem.shape

(119, 1)

In [30]:
nomefem = nomefem.assign(genero= 'feminino')

In [31]:
nomefem.head()

       nome    genero
0    Sophia  feminino
1     Júlia  feminino
2     Laura  feminino
3  Isabella  feminino
4     Luiza  feminino

In [35]:
nome = pd.concat([nomefem,nomemasc],ignore_index=True)

In [46]:
nome.head

<bound method NDFrame.head of           nome     genero
0       Sophia   feminino
1        Júlia   feminino
2        Laura   feminino
3     Isabella   feminino
4        Luiza   feminino
..         ...        ...
238   Maurício  masculino
239    Caetano  masculino
240   Anderson  masculino
241  Alexander  masculino
242      Jonas  masculino

[243 rows x 2 columns]>

In [48]:
# Verificando nulos na coluna 'nome'
print("\nVerificação de nulos na coluna 'nome':")
print(nome['nome'].isnull().sum())

Verificação de nulos na coluna 'nome':
0

In [47]:
# Verificando nulos na coluna 'genero'
print("\nVerificação de nulos na coluna 'genero':")
print(nome['genero'].isnull().sum())

Verificação de nulos na coluna 'genero':
0

In [45]:
nome.to_csv('dados/nomes.csv', index=False)